src/cf/DataProcessors/СозданиеВидеовстречи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СозданиеВидеовстречи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВидеовстречи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийАдресОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/СозданиеВидеовстречи/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Основание") Тогда
		ВызватьИсключение НСтр("ru='Недопустимый вызов формы.'");
	КонецЕсли;
	
	Объект.Основание = Параметры.Основание;
	
	ПроверитьДоступностьОбсужденийНаСервере();
	
	ИспользуетсяРаботаССобытиями = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуCRM")
		И ЭлектроннаяПочтаУНФ.ИспользуетсяРаботаССобытиями() И ПравоДоступа("Добавление", Метаданные.Документы.Событие);
		
	Элементы.ГруппаЗапланировать.Видимость = ИспользуетсяРаботаССобытиями;
	
	Если ИспользуетсяРаботаССобытиями Тогда
		
		// СтандартныеПодсистемы.НапоминанияПользователя
		ПараметрыРазмещения = НапоминанияПользователя.ПараметрыРазмещения();
		ПараметрыРазмещения.Группа = Элементы.ГруппаПараметрыНапоминания;
		ПараметрыРазмещения.ИмяРеквизитаСДатойСобытия = "НачалоСобытия";
		НапоминанияПользователя.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
		// Конец СтандартныеПодсистемы.НапоминанияПользователя
		
		КалендарьСотрудника = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойКалендарь"); 

	КонецЕсли;
	
	ИспользованиеНапоминанийРазрешено = ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя") 
		И ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.НапоминанияПользователя);
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Элементы.ДатаНачалаВремя.КнопкаВыпадающегоСписка    = Не ЭтоМобильныйКлиент;
	Элементы.ДатаОкончанияВремя.КнопкаВыпадающегоСписка = Не ЭтоМобильныйКлиент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПереключитьНаСтраницу(Элементы.СтраницаОсновная);
	
	ПроверитьДоступностьВидеоконференцийНаКлиенте();
	ЗаполнитьМаксимальноеКоличествоУчастников();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если УстановленРежимСозданияНаСервере() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "КалендарьСотрудника");
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "ДатаНачалаДата");
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "ДатаОкончанияДата");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуетсяРаботаССобытиями Тогда
		// СтандартныеПодсистемы.НапоминанияПользователя
		НапоминанияПользователяКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
		// Конец СтандартныеПодсистемы.НапоминанияПользователя
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// СтандартныеПодсистемы.НапоминанияПользователя
&НаКлиенте
Процедура Подключаемый_ПриИзмененииНастройкиНапоминания(Элемент)
	
	НапоминанияПользователяКлиент.ПриИзмененииНастройкиНапоминания(Элемент, ЭтотОбъект);
	
	УстановитьНапоминаниеНаСервере();
	
	Модифицированность = Ложь;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.НапоминанияПользователя

&НаКлиенте
Процедура ДекорацияНачатьНажатие(Элемент)
	
	УстановитьРежимНаКлиенте(РежимСоздания());
	ПереключитьНаСтраницу(Элементы.СтраницаПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗапланироватьНажатие(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не задано основание.'"));
		Возврат;
	КонецЕсли;
	
	УстановитьРежимНаКлиенте(РежимПланирования());
	ПереключитьНаСтраницу(Элементы.СтраницаПараметры);
	
	ТекущийЭлемент = Элементы.ДатаНачалаВремя;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ТемыСобытий.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.Тема = ВыбранноеЗначение;
		Если УстановленРежимПланированияНаКлиенте() Тогда
			ЗаполнитьСодержание(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДатаПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ПересчитатьДатуОкончания(ЭтотОбъект, "ДатаНачала", "ДатаОкончания");
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДатаПриИзменении(Элемент)
	
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяПриИзменении(Элемент)
	
	УправлениеНебольшойФирмойКлиент.ПересчитатьДатуОкончания(ЭтотОбъект, "ДатаНачала", "ДатаОкончания");
	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбранноеЗначение = НачалоДня(Объект.ДатаНачала) + (ВыбранноеЗначение - НачалоДня(ВыбранноеЗначение));
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяПриИзменении(Элемент)

	СформироватьПредставлениеПродолжительности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбранноеЗначение = НачалоДня(Объект.ДатаОкончания) + (ВыбранноеЗначение - НачалоДня(ВыбранноеЗначение));
	
КонецПроцедуры

&НаКлиенте
Процедура СобытиеНажатие(Элемент, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Ключ", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("СобытиеНажатиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыОткрытия, , , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьОбсуждения(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСостояниеОбсужденийНаКлиенте", ЭтотОбъект);
	ОткрытьФорму("Обработка.ПанельАдминистрированияИнтеграцийУНФ.Форма.ЧатИнтеграцияСМессенджерами", , , , , ,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеОбсуждений(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСостояниеОбсужденийНаКлиенте", ЭтотОбъект);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)

	Если ВстречаСоздана Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Или Не ДатыЗаполненыКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеВидеовстречи = ОписаниеВидеовстречи();
	Результат = ВидеовстречиКлиент.СоздатьВидеовстречу(ОписаниеВидеовстречи);
	
	Если Результат.Отказ Тогда
		ПоказатьПредупреждение(, Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОбработатьРезультатСоздания(Результат);
	СформироватьТекстПриглашения();

	Если УстановленРежимПланированияНаКлиенте() Тогда
		Оповестить("Запись_Событие");
		Оповестить("Запись_ИсточникЗаписейКалендаряСотрудника");
	КонецЕсли;
		
	ПереключитьНаСтраницу(Элементы.СтраницаГотово);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключиться(Команда)

	ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(Объект.ИдентификаторОбсуждения);
	ИдентификаторыУчастников = ИдентификаторыУчастниковОбсуждения(ИдентификаторОбсуждения);
	
	Участники = Новый КоллекцияИдентификаторовПользователейСистемыВзаимодействия;
	Для Каждого ИдентификаторУчастника Из ИдентификаторыУчастников Цикл
		Участник = Новый ИдентификаторПользователяСистемыВзаимодействия(ИдентификаторУчастника);
		Участники.Добавить(Участник);
	КонецЦикла;
	
	СистемаВзаимодействия.НачатьВидеоконференцию(, Участники, ИдентификаторОбсуждения, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбсуждение(Команда)
	
	Если Не ПустаяСтрока(Объект.АдресОбсуждения) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Объект.АдресОбсуждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоделитьсяTelegram(Команда)

	ПерейтиПоНавигационнойСсылке(СтрокаОтправитьTelegram());

КонецПроцедуры

&НаКлиенте
Процедура ПоделитьсяWhatsApp(Команда)

	ПерейтиПоНавигационнойСсылке(СтрокаОтправитьWhatsApp());
	
КонецПроцедуры

&НаКлиенте
Процедура ПоделитьсяВПисьме(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьУчастниковПоОснованиюЗавершение", ЭтотОбъект);
	
	Если УстановленРежимПланированияНаКлиенте() И ТипЗнч(Объект.Основание) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Получатели = ЭлектроннаяПочтаУНФВызовСервера.ПодготовленныеЭлектронныеАдресаПолучателей(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Основание));
			
		ПараметрыПодбора = Новый Структура("Получатели, НеВыбиратьФорматВложений", Получатели, Истина);
		ОткрытьФорму("ОбщаяФорма.ПодготовкаНовогоПисьма", ПараметрыПодбора, ЭтотОбъект , , , , ОписаниеОповещения);
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеОповещения = Новый Структура("Получатели", Неопределено);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, ДанныеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьТекстПриглашенияВБуфер(Команда)
	
	ПоместитьВБуферОбмена(ТекстПриглашения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Обсуждения

&НаКлиенте
Процедура ОбновитьСостояниеОбсужденийНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьДоступностьОбсужденийНаСервере();
	ПроверитьДоступностьВидеоконференцийНаКлиенте();
		
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступностьОбсужденийНаСервере()
	
	Попытка
		ОбсужденияДоступны 			= Обсуждения.СистемаВзаимодействийПодключена();
		ПоддерживаетсяВнешнийДоступ = ОбсужденияДоступны И СистемаВзаимодействия.ПоддерживаетсяВнешнийДоступ();	
	Исключение
		ИмяСобытия = ВидеовстречиКлиентСервер.НаименованиеСобытияЖурналаРегистрации();
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ОписаниеОшибки);
		Элементы.СтраницаОсновная.Доступность = Ложь;
		Возврат;
	КонецПопытки;

	Элементы.ПанельОшибки.Видимость = Не ОбсужденияДоступны Или Не ПоддерживаетсяВнешнийДоступ;
	Элементы.СтраницаОсновная.Доступность = Не Элементы.ПанельОшибки.Видимость;
	
	Если Не ОбсужденияДоступны Тогда
		Элементы.ТекстОшибки.Заголовок = НСтр("ru='Обсуждения не подключены.'");
		Элементы.Подключить.Видимость = Истина;
		Элементы.ОбновитьСтатусДоступностиОбсуждений.Видимость = Истина;
	ИначеЕсли Не ПоддерживаетсяВнешнийДоступ Тогда
		ТекстОшибки = НСтр("ru='Сервер системы взаимодействия не поддерживает внешний доступ.'")
			+ НСтр("ru=' Обратитесь к системному администратору.'");
		Элементы.ТекстОшибки.Заголовок = ТекстОшибки;	
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьВидеоконференцийНаКлиенте()
	
	Если Не ОбсужденияДоступны Тогда
		Возврат;
	КонецЕсли;
	
	ВидеоконференцииДоступны = СистемаВзаимодействия.ПоддерживаютсяВидеоконференции();
	Если Не ВидеоконференцииДоступны Тогда
		Элементы.ПанельОшибки.Видимость = Истина;
		Элементы.СтраницаОсновная.Доступность = Ложь;
		ТекстОшибки =  НСтр("ru='Приложение на устройстве не поддерживает видеозвонки.'")
			+ НСтр("ru=' Обратитесь к системному администратору.'");
		Элементы.ТекстОшибки.Заголовок = 	ТекстОшибки;	
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМаксимальноеКоличествоУчастников();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаксимальноеКоличествоУчастников()
	
	Если Не ОбсужденияДоступны Или Не ВидеоконференцииДоступны Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальноеКоличествоУчастников = СистемаВзаимодействия.ПолучитьМаксимальноеКоличествоУчастниковВидеоконференции();
	Элементы.ДекорацияКоличествоУчастников.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru='Максимальное количество участников: %1'"), МаксимальноеКоличествоУчастников);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторыУчастниковОбсуждения(ИдентификаторОбсуждения)
		
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(ИдентификаторОбсуждения);
	
	Если Обсуждение = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Обсуждение не найдено.'");
	КонецЕсли;
	
	ИдентификаторыУчастников = Новый Массив;
	Для Каждого Участник Из Обсуждение.Участники Цикл
		ИдентификаторыУчастников.Добавить(Участник);
	КонецЦикла;
	
	Возврат ИдентификаторыУчастников;
	
КонецФункции

#КонецОбласти

#Область Режимы

&НаКлиенте
Процедура УстановитьРеквизитыПоРежиму()
	
	Если УстановленРежимПланированияНаКлиенте() Тогда
		
		#Если НЕ МобильныйКлиент Тогда
			
		СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.ДатаНачалаВремя);
		СобытияУНФКлиентСервер.ЗаполнитьСписокВыбораВремени(Элементы.ДатаОкончанияВремя);
		
		#КонецЕсли

		СекундВ15Мин 		= 900;
		Продолжительность 	= 1800;
		
		ДатаНаМомент = ОбщегоНазначенияКлиент.ДатаСеанса();
		СекундСНачалаДня = ДатаНаМомент - НачалоДня(ДатаНаМомент);
		
		ДатаНачалаДата = НачалоДня(ДатаНаМомент);
		ДатаНачалаВремя = Дата(1, 1, 1) + Цел(СекундСНачалаДня / СекундВ15Мин) * СекундВ15Мин + СекундВ15Мин;
		
		Объект.ДатаНачала = ДатаНачалаДата + (ДатаНачалаВремя - Дата(1, 1, 1));
		
		НачалоСобытияПередИзменением = Объект.ДатаНачала;
		
		Объект.ДатаОкончания = Объект.ДатаНачала + Продолжительность;
		ДатаОкончанияДата = Объект.ДатаОкончания;
		ДатаОкончанияВремя = Объект.ДатаОкончания;
		
		СформироватьПредставлениеПродолжительности(ЭтотОбъект);
		
	ИначеЕсли УстановленРежимСозданияНаКлиенте() Тогда
		
		Объект.ДатаНачала = ОбщегоНазначенияКлиент.ДатаСеанса();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоРежиму()
	
	Элементы.КоманднаяПанельОбсуждения.Видимость = Ложь;
	Элементы.ГруппаИнформацияОКоличествеУчастников.Видимость = Истина;

	ИменаЭлементов = "Основание,ГруппаДата,ГруппаНапоминания,КалендарьСотрудника,Содержание,Событие";
	ИменаЭлементов = СтрРазделить(ИменаЭлементов, ",");
	
	ЗначениеВидимости = ?(УстановленРежимПланированияНаКлиенте(), Истина, Ложь);
	
	Если УстановленРежимПланированияНаКлиенте() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ИменаЭлементов, "ГруппаНапоминания");
		Элементы.ГруппаНапоминания.Видимость = ИспользованиеНапоминанийРазрешено;
	КонецЕсли;
	
	Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлемента, 
			"Видимость", ЗначениеВидимости);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимНаКлиенте(УстанавливаемыйРежим)
	
	Режим = УстанавливаемыйРежим;
	
	УстановитьРеквизитыПоРежиму();
	УстановитьВидимостьЭлементовПоРежиму();
	
КонецПроцедуры

&НаКлиенте
Функция УстановленРежимПланированияНаКлиенте()
	
	Возврат ТекущийРежимНаКлиенте() = РежимПланирования();
	
КонецФункции

&НаКлиенте
Функция УстановленРежимСозданияНаКлиенте()

	Возврат ТекущийРежимНаКлиенте() = РежимСоздания();

КонецФункции

&НаСервере
Функция УстановленРежимСозданияНаСервере()

	Возврат ТекущийРежимНаСервере() = РежимСоздания();

КонецФункции

&НаКлиенте
Функция ТекущийРежимНаКлиенте()
	
	Возврат Режим;
	
КонецФункции

&НаСервере
Функция ТекущийРежимНаСервере()
	
	Возврат Режим;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимСоздания()
	
	Возврат "Создание";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимПланирования()
	
	Возврат "Планирование";
	
КонецФункции

#КонецОбласти

#Область ТемаИСодержание

&НаКлиенте
Процедура ЗаполнитьСодержание(Тема)
	
	Если Не ПустаяСтрока(Объект.Содержание) Тогда
		
		ТекстВопроса = НСтр("ru = 'Заполнить содержание по выбранной теме?'");
		ДополнительныеПараметры = Новый Структура("ТемаСобытия", Тема);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьСодержаниеСобытияЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	Объект.Содержание = СодержаниеСобытияНаСервере(Тема);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСодержаниеСобытияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Содержание = СодержаниеСобытияНаСервере(ДополнительныеПараметры.ТемаСобытия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СодержаниеСобытияНаСервере(Знач Тема)
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Содержание");
	
КонецФункции

#КонецОбласти

#Область ДатаИПродолжительность

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПродолжительности(Форма)
	
	СобытияУНФКлиентСервер.СформироватьПредставлениеПродолжительности(Форма, "ПредставлениеПродолжительности",
		Форма.Объект.ДатаНачала, Форма.Объект.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Функция ДатыЗаполненыКорректно()
	
	Результат = Истина;
	
	Если УстановленРежимСозданияНаКлиенте() Тогда
		Возврат Результат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Дата начала не заполнена.'"), , "ДатаНачалаДата", , Результат);
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Дата окончание не заполнена.'"), , "ДатаОкончанияДата", , Результат);
	ИначеЕсли Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Дата начала не может быть больше даты окончания'"), , "ДатаНачалаДата", , Результат);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОтправкаПриглашения

&НаКлиенте
Процедура ЗаполнитьУчастниковПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Получатели = Результат.Получатели;
	
	ПараметрыОтправки = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();

	ПараметрыОтправки.Получатель 	= Получатели;
	ПараметрыОтправки.Тема			= Объект.Тема;
	ПараметрыОтправки.Текст 		= ТекстПисьмаHTML();
	
	Если УстановленРежимПланированияНаКлиенте() И Не Объект.Ссылка.Пустая() Тогда
		ПараметрыОтправки.Предмет = Объект.Ссылка;
	КонецЕсли;
	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки)
	
КонецПроцедуры

&НаКлиенте
Функция ТекстПисьмаHTML()
	
	ДатаВстречи = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy");
	ВремяВстречи = Формат(Объект.ДатаНачала, "ДФ=HH:mm");
	
	ШаблонТекстаПисьмаБезДаты = НСтр("ru='<!DOCTYPE html>
	|<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
	|<meta name=""format-detection"" content=""telephone=no"" />
	|</head>
	|<body>
	|<p>Добрый день.</p>
	|<br>
	|<p>Вам отправлено приглашение на видеовстречу.</p>
	|<br>
	|<p>Адрес подключения:</p>
	|<a href=""%1"">%1</a>
	|
	|</body>
	|</html>'");
	
	ШаблонТекстаПисьмаСДатой = НСтр("ru='<!DOCTYPE html>
	|<html>
	|<head>
	|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
	|<meta name=""format-detection"" content=""telephone=no"" />
	|</head>
	|<body>
	|<p>Добрый день.</p>
	|<br>
	|<p>Вам отправлено приглашение на видеовстречу %1 в %2.</p>
	|<br>
	|<p>Адрес подключения:</p>
	|<a href=""%3"">%3</a>
	|
	|</body>
	|</html>'");
	
	Если УстановленРежимПланированияНаКлиенте() Тогда
		ТекстПисьма = СтрШаблон(ШаблонТекстаПисьмаСДатой, ДатаВстречи, ВремяВстречи, Объект.АдресОбсуждения);
	Иначе
		ТекстПисьма = СтрШаблон(ШаблонТекстаПисьмаБезДаты, Объект.АдресОбсуждения);
	КонецЕсли;

	Возврат ТекстПисьма;

КонецФункции

&НаКлиенте
Функция СтрокаОтправитьTelegram()

	ШаблонОтправкиTelegram = "https://t.me/share/url?url=%1&text=%2";
	Результат = СтрШаблон(ШаблонОтправкиTelegram, Объект.ВнешнийАдресОбсуждения, СтрокаОтправкиВМессенджер());
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция СтрокаОтправитьWhatsApp()
	
	ШаблонОтправкиWhatsApp = "https://api.whatsapp.com/send/?text=%1&type=custom_url&app_absent=0";
	Результат =  СтрШаблон(ШаблонОтправкиWhatsApp, СтрокаОтправкиВМессенджер());

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СтрокаОтправкиВМессенджер()

	ДобавлятьДату = УстановленРежимПланированияНаКлиенте();
	
	ШаблонСтроки = НСтр("ru='Добрый день. Вам отправлено приглашение на видеовстречу. Адрес подключения: %1'");
	ШаблонСтрокиДата = НСтр("ru='Добрый день. Вам отправлено приглашение на видеовстречу %1 в %2. Адрес подключения: %3'");

	Если ДобавлятьДату Тогда
		СтрокаОтправки = СтрШаблон(ШаблонСтрокиДата, Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(Объект.ДатаНачала, "ДФ=HH:mm"), Объект.ВнешнийАдресОбсуждения);
	Иначе
		СтрокаОтправки = СтрШаблон(ШаблонСтроки,  Объект.ВнешнийАдресОбсуждения);
	КонецЕсли;

	Возврат СтрокаОтправки;
	
КонецФункции

#КонецОбласти

#Область Напоминание

&НаКлиенте
Процедура СобытиеНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеНапоминанияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНапоминанияНаСервере()

	ИмяПоляНапоминатьОСобытии = НапоминанияПользователяКлиентСервер.ИмяПоляНапоминатьОСобытии();
	ИмяПоляИнтервалВремениНапоминания = НапоминанияПользователяКлиентСервер.ИмяПоляИнтервалВремениНапоминания();
	
	НастройкиНапоминания = НапоминанияПользователяКлиентСервер.НастройкиНапоминанияВФорме(ЭтотОбъект);
	Если НастройкиНапоминания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НапоминанияПоПредмету = НапоминанияПользователя.НайтиНапоминания(Объект.Ссылка);
	Если Не НапоминанияПоПредмету.Количество() Тогда
		
		ЭтотОбъект[ИмяПоляНапоминатьОСобытии] = Ложь;
		
		Если Не НастройкиНапоминания.ДобавлятьФлажок Тогда
			ЭтотОбъект[ИмяПоляИнтервалВремениНапоминания] = НапоминанияПользователяКлиентСервер.ПредставлениеПеречисленияНеНапоминать();
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;

	ДанныеСобытия = Новый Структура("Ссылка", Объект.Ссылка);
	// СтандартныеПодсистемы.НапоминанияПользователя
	НапоминанияПользователя.ПриЧтенииНаСервере(ЭтотОбъект, ДанныеСобытия);
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНапоминаниеНаСервере()

	ДанныеСобытия = Новый Структура("Ссылка", Объект.Ссылка);
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	НапоминанияПользователя.ПриЗаписиНаСервере(ЭтотОбъект, Ложь, ДанныеСобытия, Новый Структура);
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПереключитьНаСтраницу(Страница)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
	
	Для Каждого СтраницаГруппы Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
		СтраницаГруппы.Видимость = Ложь;
	КонецЦикла;

	Страница.Видимость = Истина;

	Если Страница = Элементы.СтраницаОсновная Тогда
		Элементы.ГруппаКоманды.Видимость = Ложь;
	ИначеЕсли Страница = Элементы.СтраницаПараметры Тогда
		Элементы.ГруппаКоманды.Видимость = Истина;
		Элементы.КоманднаяПанельОбсуждения.Видимость = Ложь;
	ИначеЕсли Страница = Элементы.СтраницаГотово Тогда
		Элементы.КоманднаяПанельОбсуждения.Видимость 				= Истина;
		Элементы.ГруппаИнформацияОКоличествеУчастников.Видимость 	= Ложь;
		Элементы.СкопироватьТекстПриглашенияВБуфер.Видимость 		= СредстваБуфераОбмена.ИспользованиеДоступно();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеВидеовстречи()
	
	ОписаниеВидеовстречи = ВидеовстречиКлиентСервер.ОписаниеВидеовстречи();
	
	Если УстановленРежимПланированияНаКлиенте() Тогда
		
		ОписаниеВидеовстречи.СоздатьСобытие = Истина;
		ОписаниеВидеовстречи.КалендарьСотрудника = КалендарьСотрудника;
		ЗаполнитьЗначенияСвойств(ОписаниеВидеовстречи, Объект, "ДатаНачала, ДатаОкончания");
		
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Тема) Тогда
		ШаблонТемы = НСтр("ru='Встреча от %1'");
		Объект.Тема = СтрШаблон(ШаблонТемы, Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОписаниеВидеовстречи, Объект, "Основание, Содержание, Тема");
	
	Возврат ОписаниеВидеовстречи;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатСоздания(Результат)
	
	ЗаполнитьЗначенияСвойств(Объект, Результат, "АдресОбсуждения, ВнешнийАдресОбсуждения, ИдентификаторОбсуждения");
	
	Если Результат.СобытиеСоздано Тогда
		Объект.Ссылка = Результат.ДокументСобытия;
	КонецЕсли;
	
	ВстречаСоздана = Результат.ОбсуждениеСоздано;
	
	Элементы.Отменить.Видимость = Ложь;
	Элементы.Подключиться.Видимость = Истина;
	Элементы.Создать.Заголовок = НСтр("ru='Закрыть'");

КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстПриглашения()
	
	Если УстановленРежимПланированияНаКлиенте() Тогда
		ШаблонПриглашения = НСтр("ru='Добрый день. Вам отправлено приглашение на видеовстречу %1 в %2.
			|
			|Адрес подключения: %3'");
		ТекстПриглашения = СтрШаблон(ШаблонПриглашения, Формат(Объект.ДатаНачала, "ДФ='dd.MM.yyyy'"), 
			Формат(Объект.ДатаНачала, "ДФ='HH:mm'"), Объект.АдресОбсуждения);
	Иначе
		ШаблонПриглашения = НСтр("ru='Добрый день. Вам отправлено приглашение на видеовстречу.
			|
			|Адрес подключения: %1'");
		ТекстПриглашения = СтрШаблон(ШаблонПриглашения, Объект.АдресОбсуждения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПоместитьВБуферОбмена(Текст)
	
	ПомещаемыеДанные = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, Текст);
	Результат = Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ПомещаемыеДанные);

	Если Результат Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Приглашение'"), , НСтр("ru='Текст приглашения скопирован.'"), БиблиотекаКартинок.Информация32);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru='Приглашение'"), , НСтр("ru='Не удалось скопировать текст приглашения.'"), БиблиотекаКартинок.Ошибка32);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
